'''
    瓜数据集中一个西瓜属性有：色泽、根蒂、敲声、纹理、脐部和触感。
    对于色泽，有：青绿、乌黑、浅白，分别记为：1，0，-1。
    对于根蒂，有：蜷缩、稍蜷、硬挺，分别记为：-1，0，1。
    对于敲声，有：浊响、沉闷、清脆，分别记为：1，0，-1。
    对于纹理，有：清晰、稍糊、模糊，分别记为：1，0，-1。
    对于脐部，有：凹陷、稍凹、平坦，分别记为：1,0，-1。
    对于触感，有：硬滑、软粘，分别记为：1，-1。
    对于结果，有：好瓜记为1，坏瓜记为0。
'''

'''
对于使用的神经网络结构，设计为三层神经网络：输入层input、隐层hidden、输出层output。
输入层有七个神经元，为六个属性和一个偏置值（取1）；
隐层有五个神经元，为四个第一层的输出值和一个偏置值（取1）；
输出层有一个神经元
'''
import numpy as np

data = [1,-1,1,1,1,0,1,
0,-1,0,1,1,0,1,
0,-1,1,1,1,0,1,
1,-1,0,1,1,0,1,
1,-1,1,1,1,0,1,
1,0,1,1,0,-1,1,
0,0,1,1,0,-1,1,
0,0,1,0,0,0,1,
0,0,0,1,0,0,1,
1,1,-1,0,-1,-1,1,
-1,1,-1,-1,-1,0,1,
-1,-1,1,-1,-1,-1,1,
1,0,1,0,1,0,1,
-1,0,0,0,1,0,1,
0,0,1,1,0,-1,1,
-1,-1,1,-1,-1,0,1,
0,-1,0,0,0,0,1]

data_set = np.array(data).reshape(17,7)# X输入值
results = [1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0]
y = np.array(results).reshape(17,1)#y输入值

w1=[]
w2=[]

np.random.seed(1)#设定随机种子数

#随机产生输入层到隐层的权值
for i in range(7):#7x4
    for j in range(1,5):
        w=np.random.randn()
        w1.append(w)

#随机产生隐层到输出层的权值
for d in range(1,6): #5x1
    w=np.random.randn()
    w2.append(w)
    
print(len(w2))


